#include "consol.h"
void help(){
    printf("Course work for option 5.9, created by Nikita Matveev\n");
    printf("Программа предназначена для обработки BMP изображений: без сжатия, 24 бита на пиксель.\n");
    printf("Доступный функционал:\n");
    printf("-h/--help  -  Вывод справки о программе\n");
    printf("-I/--info  -  Вывод информации об изображении\n");
    printf("-i/--input  -  Имя входного изображения\n");
    printf("-o/--output  -  Имя выходного изображения\n");
    printf("--squared_lines - Флаг для рисования квадрата с диагоналями. Квадрат определяется:\n");
    printf("    --left_up  -  Координаты левого угла, значение задаётся в формате `left.up`, где left – координата по x, up – координата по y\n");
    printf("    --side_size - Размер стороны, значение должно быть целым числом больше 0\n");
    printf("    --thickness  -  Толщина линии, значение должно быть целым числом больше 0\n");
    printf("    --color  -  Цвет линий, задаётся строкой `rrr.ggg.bbb`, где rrr/ggg/bbb – числа, задающие цветовую компоненту\n");
    printf("    --fill - Наличие заливки, работает как бинарное значение: флага нет – false , флаг есть – true.\n");
    printf("    --fill_color - Цвет заливки, задаётся строкой `rrr.ggg.bbb`, где rrr/ggg/bbb – числа, задающие цветовую компоненту\n");
    printf("--rgbfilter - Флаг для изменения заданной компоненты цвета на переданное значение. Функционал определяется:\n");
    printf("    --component_name - Имя компоненты, возможные значения `red`, `green` и `blue`\n");
    printf("    --component_value - Принимает значение в виде числа от 0 до 255\n");
    printf("--rotate - Флаг для поворота изображения (части) на 90/180/270 градусов. Функционал определяется:\n");
    printf("    --left_up  -  Координаты левого угла, значение задаётся в формате `left.up`, где left – координата по x, up – координата по y\n");
    printf("    --right_down  -  Координаты правого угла, значение задаётся в формате `right.down`, где right – координата по x, down – координата по y\n");
    printf("    --angle - Угол поворота, допустимые значения: `90`, `180`, `270`\n");
    printf("--circle - Флаг для рисования окружности. Окружность определяется:\n");
    printf("    --center - Координаты центра, задаётся в формате `x.y`, где x – координата по оси x, y – координата по оси y.\n");
    printf("    --radius - Радиус, значение должно быть целым числом больше 0\n");
    printf("    --thickness  -  Толщина линии, значение должно быть целым числом больше 0\n");
    printf("    --color  -  Цвет линий, задаётся строкой `rrr.ggg.bbb`, где rrr/ggg/bbb – числа, задающие цветовую компоненту\n");
    printf("    --fill - Наличие заливки, работает как бинарное значение: флага нет – false , флаг есть – true.\n");
    printf("    --fill_color - Цвет заливки, задаётся строкой `rrr.ggg.bbb`, где rrr/ggg/bbb – числа, задающие цветовую компоненту\n");
}
